#### Import libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

#### Load Data

In [4]:
data = pd.read_csv("Social_Network_Ads.csv")
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

#### Transform Data

In [6]:
# Add Remap "Gender" Column
data["Gender"] = data["Gender"].map({"Male":1, "Female":0})
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0

In [7]:
# For newer versions of Python/Jupyter, change default so that method config attributes always show
from sklearn import set_config
set_config(print_changed_only=False, display='diagram')

In [8]:
# Scale "EstimatedSalary" and "Age" columns
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

In [9]:
# Scale "EstimatedSalary" and "Age" columns
columns_to_scale = data[["Age", "EstimatedSalary"]]
scaler.fit(columns_to_scale)
data[["Age_Scaled", "Salary_Scaled"]] = scaler.fit_transform(columns_to_scale)
data.head()

,User ID,Gender,Age,EstimatedSalary,Purchased,Age_Scaled,Salary_Scaled
0,15624510,1,19,19000,0,-1.781797,-1.490046
1,15810944,1,35,20000,0,-0.253587,-1.460681
2,15668575,0,26,43000,0,-1.113206,-0.785290
3,15603246,0,27,57000,0,-1.017692,-0.374182
4,15804002,1,19,76000,0,-1.781797,0.183751

#### Export For Model

In [11]:
# Rearracnge columns
data_for_model = data[['User ID', 'Gender', 'Age_Scaled', 'Salary_Scaled', 'Purchased']]

In [12]:
data_for_model.to_csv("processed_data.csv", index=False)